Tekla Open API Reference for Tekla Structures 2025
ShellEnumerator Properties
The ShellEnumerator type exposes the following members.
Properties
Name | Description
Current
 Gets the current shell.
Top
See Also
Reference
ShellEnumerator Class
Tekla.Structures.Solid Namespace